
Network Working Group                                       K. Chowdhury
Internet-Draft                                           Nortel Networks
Expires: December 23, 2004                                     P. Yegani
                                                           Cisco Systems
                                                               L. Madour
                                                                Ericsson
                                                           June 24, 2004


       DHCPv6 Options for Broadcast and Multicast Control Servers
                draft-chowdhury-dhc-bcmcv6-option-00.txt

Status of this Memo

   By submitting this Internet-Draft, I certify that any applicable
   patent or other IPR claims of which I am aware have been disclosed,
   and any of which I become aware will be disclosed, in accordance with
   RFC 3668.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as
   Internet-Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on December 23, 2004.

Copyright Notice

   Copyright (C) The Internet Society (2004).  All Rights Reserved.

Abstract

   This document defines new options for Broadcast and Multicast Service
   controller discovery in an IP network.  Broadcast and Multicast
   service over 3G wireless networks are being developed at the time of
   writing this document.  Users of this service interact with a
   controller in the network to derive informations that are required to
   receive broadcast service.  Dynamic Host Configuration Protocol can



Chowdhury, et al.      Expires December 23, 2004                [Page 1]

Internet-Draft                                                 June 2004


   be used to configure the controller IPv6 addresses in the user's
   devices.  This document defines the related options and option codes.

Table of Contents

   1.  Motivation . . . . . . . . . . . . . . . . . . . . . . . . . .  3
   2.  Overview . . . . . . . . . . . . . . . . . . . . . . . . . . .  4
   3.  Terminology  . . . . . . . . . . . . . . . . . . . . . . . . .  6
   4.  Broadcast Service Controller Options . . . . . . . . . . . . .  7
     4.1   Broadcast Service Controller Domain Name List option . . .  7
     4.2   Broadcast Service Controller IPv6 address option . . . . .  8
   5.  Consideration for Client Operation . . . . . . . . . . . . . .  9
   6.  Consideration for Server Operation . . . . . . . . . . . . . . 10
   7.  Security Considerations  . . . . . . . . . . . . . . . . . . . 11
   8.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 12
   9.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 13
   10.   Normative References . . . . . . . . . . . . . . . . . . . . 13
       Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . 13
       Intellectual Property and Copyright Statements . . . . . . . . 15
































Chowdhury, et al.      Expires December 23, 2004                [Page 2]

Internet-Draft                                                 June 2004


1.  Motivation

   Dynamic Host Configuration Protocol can be used to configure various
   non-IP address type of parameters.  These parameters are required for
   normal operation of various services that are offered over an IP
   network.

   In 3G wirelesss network standards body such as 3GPP2 (www.3gpp2.org),
   broadcast and multicast service is being developed [BCMCS].  The
   service includes a controller component that is responsible for
   managing the service via interaction with the users and other network
   entities.  The users of the service are required to know the IPv6
   address of the controller entity so that they can download all the
   necessary information about a desired broadcast program.  In a
   roaming environment static configuration of the controller IPv6
   address becomes unrealistic.  Therefore, DHCP [RFC3315] is considered
   to be a method to dynamically configure controller IPv6 address in
   the user's devices in the 3G wireless networks.  DHCP can also be
   used to convey the fully qualified domain name of the broadcast
   service controller to the user.  The user in turn makes DNS queries
   to obtain the IPv6 address of the associated broadcast service
   controller.

   In order to allow the users to discover the broadcast controllers,
   the clients need to request for appropriate option codes from the DHC
   servers using Option-Request-Option and the DHC servers need to
   return corresponding configuration options that carry the broadcast
   and multicast service controller IPv6 address or Domain Name list.
   The motivation for this document is to define the necessary options
   and option codes.





















Chowdhury, et al.      Expires December 23, 2004                [Page 3]

Internet-Draft                                                 June 2004


2.  Overview

   The Broadcast and Multicast Service architecture in a 3G wireless
   network such as 3GPP2 has the following model:




              Control Info       +------------+   +--------+
         +---------------------->|            |   |        |
         |        HTTP+XML       | Controller |   |  DHCP  |
         |                       |            |   | Server |
         |                       +------------+   +--------+
         |                              |    |
         |                       Control|    |  Control
         |                          Info|    |  Info
         |                              |    +---------------+
         |                              |                    |
         |                          +-------+                |
         |                          |       |                |
         |                          |  AAA  |                |
         |                          |       |                |
         |                          +-------+                |
         |                              |                    |
         |                       Control|                    |
         |                          Info|                    |
         V                              |                    V
      +----+        +------------+    +------------+    +------------+
      |    |        |            |    |            |    |            |
      | MN/| bearer |   Radio    |    |  Access    |    | Broadcast  |
      |User|<-------|   Access   |<---|  Gateway   |<---| Content    |
      |    |        |   Network  |    |            |    | Server     |
      +----+        +------------+    +------------+    +------------+


   Note that this inforamtive figure is shown here for broad
   understanding of how Broadcast and Multicast service works in a 3G
   radio network.  The network elements except MN/user and the DHCP
   server are not relevant to the text in this document.

   The user interacts with the Controller to request for broadcast/
   multicast program information from the network (e.g., scheduled time,
   multicast IP address, port numbers).  The User may also be
   authenticated by the Controller while downloading the relevant
   program security related information (such as encryption key).  These
   interactions happen via HTTP and XML.  For details of Broadcast and
   Multicast Service operation in 3GPP2, see [BCMCS].  There may be more
   than one controller in the network.  The user should discover the



Chowdhury, et al.      Expires December 23, 2004                [Page 4]

Internet-Draft                                                 June 2004


   appropriate controller to request the relevant program information.


















































Chowdhury, et al.      Expires December 23, 2004                [Page 5]

Internet-Draft                                                 June 2004


3.  Terminology

   The keywords "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD",  "SHOULD  NOT",  "RECOMMENDED",  "MAY",  and "OPTIONAL" in
   this document are to be interpreted as described in RFC 2119.














































Chowdhury, et al.      Expires December 23, 2004                [Page 6]

Internet-Draft                                                 June 2004


4.  Broadcast Service Controller Options

   This section defines the configuration options for the controller of
   Broadcast Service.  The options in the document are specified similar
   to [RFC3319].

4.1  Broadcast Service Controller Domain Name List option

   The option length is followed by a sequence of labels, encoded
   according to Section 3.1 of RFC 1035 [5].

   The option MAY contain multiple domain names, but these domain names
   SHOULD be used to construct SRV lookups as specified in [BCMCS],
   rather than querying for different A records.  The client MUST try
   the records in the order listed, applying the mechanism described in
   [BCMCS] for each entry.  The client only resolves the subsequent
   domain names if attempts to contact the first one failed or yielded
   no common transport protocols between the client and the controller
   or denote a domain administratively prohibited by client's policy.
   Use of multiple domain names is not meant to replace the SRV records,
   but rather to allow a single DHCP server to indicate the broadcast
   controllers in the access provider's network.  Clients MUST support
   compression according to the encoding in Section 4.1.4 of "Domain
   Names - Implementation And Specification .

   The DHCPv6 option for Boradcast Service Controller Domain Names has
   the format shown below.

   option-code: OPTION_BCMCS_SERVER_D (TBD)

   option-length: Length of the 'Broadcast Control Server Domain Name
   List' field in octets; variable.



       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |      OPTION_BCMCS_SERVER_D    |         option-length         |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |          Broadcast Control Domain Name List                   |
      |                              ...                              |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+








Chowdhury, et al.      Expires December 23, 2004                [Page 7]

Internet-Draft                                                 June 2004


4.2  Broadcast Service Controller IPv6 address option

   This DHCP option SHALL carry one or more 128-bit IPv6 address(es) of
   the Broadcast Service Controller in a operators network.

   option-code: OPTION_BCMCS_SERVER_A (TBD)

   option-length: Length of the 'Broadcast Control Server IPv6 address'
   field in octets; variable.


       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |      OPTION_BCMCS_SERVER_A    |         option-length         |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                                                               |
      |    Broadcast Control server-1 address (IPv6 address)          |
      |                                                               |
      |                                                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                                                               |
      |    Broadcast Control server-2 address (IPv6 address)          |
      |                                                               |
      |                                                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                              ...                              |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+























Chowdhury, et al.      Expires December 23, 2004                [Page 8]

Internet-Draft                                                 June 2004


5.  Consideration for Client Operation

   A client MAY request either or both of the Broadcast Service
   Controller Domain Name List and the IPv6 Address options in the
   Options Request Option (ORO) as described in [RFC3315].

   If a client receives both the Broadcast Service Controller Domain
   Name List and IPv6 Address options, it SHOULD use the Domain Name
   List option.  In this case, the client MAY use the Broadcast Service
   Controller IPv6 Address option only if, no server in the Broadcast
   Service Controller Domain Name List can be resolved or reached.








































Chowdhury, et al.      Expires December 23, 2004                [Page 9]

Internet-Draft                                                 June 2004


6.  Consideration for Server Operation

   A server MAY send a client one or both of the Broadcast Service
   Controller Domain Name List and Broadcast Service Controller IPv6
   Address options if the server is configured to do so.

   If a client requests both options and the server is configured with
   both types of information, the server MAY send the client only one of
   these options if it is configured to do so.  In this case the server
   SHOULD send the Broadcast Service Controller Domain Name List option.

   A server configured with the Broadcast Service Controller IPv6
   Address information MUST send a client the Broadcast Service
   Controller IPv6 Address option if that client requested only the
   Broadcast Service Controller IPv6 address option and not the
   Broadcast Service Controller Domain Name List option in the ORO
   (RFC3315]).

   If a client requests for the Broadcast Service Controller IPv6 option
   and the Server is configured only with the Domain Names, the Server
   MUST return the Domain Names List and vice versa.

   The following table summarizes the server's response:


   Client sends in ORO     Domain Name List        IPv6 Address List
   __________________________________________________________________

   Neither option          SHOULD                  MAY
   Domain Name List        MUST                    MAY
   IPv6 Address            MAY                     MUST
   Both options            SHOULD                  MAY



















Chowdhury, et al.      Expires December 23, 2004               [Page 10]

Internet-Draft                                                 June 2004


7.  Security Considerations

   The security considerations in the base DHCPv6 spec [RFC3315]
   applies.  An attacker may change information of the Broadcast Service
   Controller in packets that are in-tranist from DHCP server to the MN,
   if integrity protection is not in place.  In that event, the user of
   the Broadcast service may be diverted to a rogue broadcast service
   controller.  In the absence of a mutual authentication procedure
   between MN and the Broadcast controller, the MN may receive wrong or
   fraudulent information about Broadcast Service.









































Chowdhury, et al.      Expires December 23, 2004               [Page 11]

Internet-Draft                                                 June 2004


8.  IANA Considerations

   The option codes OPTION_BCMCS_SERVER_A, OPTION_BCMCS_SERVER_D for
   Broadcast Service Controller Domain Name list and IPv6 address
   respectively Must be assigned by IANA.














































Chowdhury, et al.      Expires December 23, 2004               [Page 12]

Internet-Draft                                                 June 2004


9.  Acknowledgements

   Thanks to the follwoing indivduals for their review and constructive
   comments during the development of this document:

   AC Mahendran, Jun Wang, Raymond Hsu, Jayshree Bharatia.

10  Normative References

   [BCMCS]    3GPP2, www.3gpp2.org, "X.P0022, Broadcast and Multicast
              Service in cdma2000 Wireless IP Network.", October 2003.

   [RFC1035]  Mockapetris, P., "Domain names - implementation and
              specification", STD 13, RFC 1035, November 1987.

   [RFC3315]  Droms, R., Bound, J., Volz, B., Lemon, T., Perkins, C. and
              M. Carney, "Dynamic Host Configuration Protocol for IPv6
              (DHCPv6)", RFC 3315, July 2003.

   [RFC3319]  Schulzrinne, H. and B. Volz, "Dynamic Host Configuration
              Protocol (DHCPv6) Options for Session Initiation Protocol
              (SIP) Servers", RFC 3319, July 2003.


Authors' Addresses

   Kuntal Chowdhury
   Nortel Networks
   2221 Lakeside Blvd.
   Richardson, TX  75082
   US

   Phone: +1 972-685-7788
   EMail: chowdury@nortelnetworks.com


   Parviz Yegani
   Cisco Systems
   3625 Cisco Way
   San Jose, CA  95134
   US

   Phone: +1 408-832-5729
   EMail: pyegani@cisco.com







Chowdhury, et al.      Expires December 23, 2004               [Page 13]

Internet-Draft                                                 June 2004


   Lila Madour
   Ericsson
   8400, Decarie Blvd
   Town of Mount Royal, Quebec  H4P 2N2
   CANADA

   Phone: +1 514-345-7900
   EMail: Lila.Madour@ericsson.com











































Chowdhury, et al.      Expires December 23, 2004               [Page 14]

Internet-Draft                                                 June 2004


Intellectual Property Statement

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the procedures with respect to rights in RFC documents can be
   found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of
   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at
   ietf-ipr@ietf.org.


Disclaimer of Validity

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET
   ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED,
   INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE
   INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.


Copyright Statement

   Copyright (C) The Internet Society (2004).  This document is subject
   to the rights, licenses and restrictions contained in BCP 78, and
   except as set forth therein, the authors retain all their rights.


Acknowledgment

   Funding for the RFC Editor function is currently provided by the
   Internet Society.




Chowdhury, et al.      Expires December 23, 2004               [Page 15]


